src/Documents/ПоставкаТовара/ПоставкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоставкаТовара</name>
  <registerRecords>AccumulationRegister.ПоставкаИОтправкаТоваров</registerRecords>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВыгрузкиТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьПоставкаТовара</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товар</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПоставкаИОтправкаТоваров/ПоставкаИОтправкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПоставкаИОтправкаТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товар</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресОТкуда</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресКуда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПоставкаТовара/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ПоставкаИОтправкаТоваров
	Движения.ПоставкаИОтправкаТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧастьПоставкаТовара из ТабличнаяЧастьПоставкаТовара Цикл
		Движение = Движения.ПоставкаИОтправкаТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Товар = ТекСтрокаТабличнаяЧастьПоставкаТовара.Товар;
		Движение.АдресКуда = АдресВыгрузкиТовара;
		Движение.Количество = ТекСтрокаТабличнаяЧастьПоставкаТовара.Количество;
		Движение.Цена = ТекСтрокаТабличнаяЧастьПоставкаТовара.Цена;
		Движение.Сумма = ТекСтрокаТабличнаяЧастьПоставкаТовара.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
